// описуємо 7 фігур (їх вертикальні та горизонтальні версії)
// завжди йдемо проти часової стрілки
const int I_SHAPE[2][4][2] =
    {            // 2 елементи масива (описує вертикальну і горизонтальну)
        {        // по 4 елементи масива (описує кількість пікселів в фігурі)
         {0, 0}, // по 2 елементи масива (описує x,y пікселя)
         {0, 1},
         {0, 2},
         {0, 3}},
        {// це горизонтальна версія
         {-1, 1},
         {0, 1},
         {1, 1},
         {2, 1}}};

// в квадрату не потрібна горизонтальна версія
const int O_SHAPE[1][4][2] =
    {
        {{0, 0},
         {1, 0},
         {0, 1},
         {1, 1}}};

// 4 версії фігури Т
const int T_SHAPE[4][4][2] =
    {
        {{1, 0}, {0, 1}, {1, 1}, {2, 1}},
        {{1, 0}, {1, 1}, {1, 2}, {0, 1}},
        {{0, 1}, {1, 1}, {2, 1}, {1, 2}},
        {{1, 0}, {1, 1}, {1, 2}, {2, 1}}};

// 4 версії L
const int L_SHAPE[4][4][2] = {
    {{0, 0}, {0, 1}, {0, 2}, {1, 2}},
    {{0, 0}, {1, 0}, {2, 0}, {0, 1}},
    {{0, 0}, {1, 0}, {1, 1}, {1, 2}},
    {{2, 0}, {0, 1}, {1, 1}, {2, 1}}};

// 4 версії J (те ж що і L, але дзеркальне відображення)
const int J_SHAPE[4][4][2] = {
    {{1, 0}, {1, 1}, {1, 2}, {0, 2}},
    {{0, 0}, {0, 1}, {1, 1}, {2, 1}},
    {{0, 0}, {1, 0}, {0, 1}, {0, 2}},
    {{0, 0}, {1, 0}, {2, 0}, {2, 1}}};

// 2 версії S    
const int S_SHAPE[2][4][2] = {
    {{1, 0}, {2, 0}, {0, 1}, {1, 1}},
    {{1, 0}, {1, 1}, {2, 1}, {2, 2}}};

// 2 версії Z
const int Z_SHAPE[2][4][2] = {
    {{0, 0}, {1, 0}, {1, 1}, {2, 1}},
    {{2, 0}, {1, 1}, {2, 1}, {1, 2}}};